def solve(a, b, c)
    @D = (b ** 2) - (4 * a * c)
    @x1 = 0, @x2 = 0
    if @D < 0
        puts "Дискриминант равен: #{@D}. Действительных корней нет"
    elsif @D == 0
        @x1 = -b / (2 * a)
        puts "Дискриминант равен: #{@D}. Действительный корень один, и он равен #{@x1}"
    else
        @x1 = (-b + Math.sqrt(@D)) / (2 * a)
        @x2 = (-b - Math.sqrt(@D)) / (2 * a)
        puts "Дискриминант равен: #{@D}. Действительные корни - #{@x1} и #{@x2}"
    end
end

solve(6, 1, -1)
solve(2, -9, 4)
solve(1, -10, 25)